---
kind: property
id: P:Autodesk.Revit.DB.CustomExporter.ShouldStopOnError
source: html/bc21fee5-c194-4d19-cd12-0a285e854a5e.htm
---
# Autodesk.Revit.DB.CustomExporter.ShouldStopOnError Property

This flag instructs the exporting process to either stop or continue
 in case an error occurs during any of the exporting methods.

## Syntax (C#)
```csharp
public bool ShouldStopOnError { get; set; }
```